[Cues]
Cue_E5_7C_Beach_Insertion_Chloe_020="I see that the real Max is back... So, how was your time trip, dude? "
Cue_E5_7C_Beach_Insertion_Chloe_040="Looks like even fate doesn’t want us apart... You traveled through multiple realities just to save my ungrateful ass over and over... I hope it was worth it, but I don’t blame you for wanting me out of your life after all my drama..."
Cue_E5_7C_Beach_Insertion_Chloe_060="You’re Max Fucking Caulfield, Time Warrior. Even if you weren’t, you’re kind and caring... Nobody could have a better best friend... Nobody. You didn’t ask for any of this to happen but it did... and you need to accept how awesome you are..."
Cue_E5_7C_Beach_Insertion_Chloe_080="Then for whatever scientific mystical reason that we’ll obviously never figure out...we were meant to be together at this exact moment in history... I have to think that Rachel was somewhere behind the scenes, fighting for justice..."
Cue_E5_7C_Beach_Insertion_Chloe_100="Well...we left the party and made sure Jefferson couldn’t find us. For once I was glad I lived in an actual fortress...Then the storm got hella crazy and you said we would be safe at the lighthouse..."
Cue_E5_7C_Beach_Insertion_Chloe_120="Stop it! Stop beating yourself up! We’ve both paid our dues on that already... look at that... God, look at that monster... Who knows... this storm could be Rachel’s Revenge... Our revenge..."
Cue_E5_7C_Beach_Insertion_Chloe_130="Max, you were right!"
Cue_E5_7C_Beach_Insertion_Chloe_135="The lighthouse is out of the way of the tornado! Come on!"
Cue_E5_7C_Beach_Insertion_Chloe_150="I‘ve got your back, Max."
Cue_E5_7C_Beach_Insertion_Max_010="Oh Chloe..."
Cue_E5_7C_Beach_Insertion_Max_030="Shut up... Oh, you're alive. You're alive, oh... Both of us.
I did so much to bring you back, Chloe… and, it worked… it actually worked. You’re with me again."
Cue_E5_7C_Beach_Insertion_Max_050="Come on, I’m the official Drama King and Queen of Arcadia Bay, this week. Just look at what my powers have caused in... just a short time. I mean… I’m nobody."
Cue_E5_7C_Beach_Insertion_Max_070="Maybe I willed it subconsciously, or something. I always wanted my life to be special… an adventure… but not without you. And, it didn’t happen until I moved back here, so... without you, my powers wouldn't even exist."
Cue_E5_7C_Beach_Insertion_Max_090="I’d like to think that too. We all owe Rachel Amber. Now tell me everything that happened... you remember, right?"
Cue_E5_7C_Beach_Insertion_Max_110="Chloe, look… the storm is getting bigger now. It's coming closer, oh… I can’t even believe this is real, but this is happening because of me."
Cue_E5_7C_Beach_Insertion_Max_140="(faint) Chloe…"
